nginx-home/laravel/app/Providers/FortifyServiceProvider.php

    public function boot()
    {
        Fortify::createUsersUsing(CreateNewUser::class);
        Fortify::updateUserProfileInformationUsing(UpdateUserProfileInformation::class);
        Fortify::updateUserPasswordsUsing(UpdateUserPassword::class);
        Fortify::resetUserPasswordsUsing(ResetUserPassword::class);

        Fortify::authenticateUsing(function (Request $request) {

            $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'allprofiles@orthanc.test' limit 1