nginx-home/laravel/app/Models/Patients/Insurance.php

select * from `insurance` where (`mrn` = '0001') order by `priority` asc
---
    protected static function getPatientInsurancesByMRN ($mrn) {

		$insurances = self::where(["mrn" => $mrn])->orderBy('priority')->get();