nginx-home/laravel/app/Actions/Orthanc/OrthancAPI.php

	public function initServer($serverid) {

		if (!empty($serverid)) {
        $this->server = DB::table('orthanc_hosts')->where('id', $serverid)->first();
---
select * from `orthanc_hosts` where `id` = 1 limit 1

    public static function getServersArray() {

    	$query = 'SELECT * from orthanc_hosts';
    	return DB::table('orthanc_hosts')->get();
---
select * from `orthanc_hosts`