nginx-home/laravel/app/Models/Facility.php

    protected static function getPropertyValue($id, $property) {

        $facility = self::where('id', $id)->first();
---
select * from `facility` where `id` = '1' limit 1

    protected static function getMailingAddress($id) {

        $facility = self::where('id', $id)->first();
---
select * from `facility` where `id` = '1' limit 1

    protected static function getPhoneFAXEmailWeb($id) {

         $facility = self::where('id', $id)->first();
---
select * from `facility` where `id` = '1' limit 1